# 연산자
# + - * 등 이미 정의된 연산 수행하는 기호, 키워드
# 문제를 해결하는 방법에서 도구(장비)의 역할

# 오퍼랜드 연산제 참여하는 변수나 값(피연산자)

a = 5; b =3
print(a+b, a-b, a*b, a/b, a//b, a%b, a **b)

# // 는 파이썬의 연산자
# a = 5//3 이면 5를 3으로 나눈 뒤 소수점 버리고 a에 대입
# 즉, 나눈 몫을 넣음(나머지가 아니라 몫)
# 즉, 5//3은 1이 됨 (1.6666.. 이므로)

# ** 로 제곱을 사용함 5**3 이면 5의 3제곱 125

# 문자열이 int()로 정수로, float()로 실수로 변경
s1 = "100.123"
print(float(s1))
# 근데 100.123을 int(100.123) 이건 안됨

# 숫자를 문자열로 변경
a = 100; b = 100.123
print(str(a)+'1')
print(str(b)+'1')

#관계연산자
# 결과는 boolean true/false로 나옴
a, b = 100, 200
print(a==b, a!=b, a>b, a<b, a>=b, a<=b)
# F T F T F T

# 논리연산자
a = 99
(a>100) and (a<200) # 뒤에꺼 고려하지 않음 F
(a>100) or (a < 200) # 뒤에꺼 고려해서 참이됨 T
not(a ==100) #T



print( 25//10 ** 2 +1)
# 이거는 25를 100으로 나눈 몫에 거기에 1을 더함
# 1 출력 

a, b = "100", 200
print(a + str(b))
# 100200 출력









